{
"使用须知":[
"使用须知：",
"1、所有脚本都不保证没有封号风险，怕别用，封认罚。" ,
"2、脚本从开发以来两个月，暂无封禁或警告案例。当发现相关案例，我会立刻在视屏评论区置顶通知。" ,
"3、本脚本使用python编写，不读写内存。使用实时截屏在关键节点进行读屏判断，使用模拟鼠标点击，移动，键盘按键进行操作，本质为连点器。" ,
"4、脚本运行期间任何键鼠操作都可能导致脚本运行失败，请点击界面上“停止”按钮或键盘组合键“ctrl+/”停止脚本。" ,
"5、本脚本为绿色免安装版，无联网功能。账号请自行设置长期默认登录，本脚本无登录功能，本人没有心情也没有能力写病毒和盗号功能。" ,
"6、脚本运行需要管理员权限，用于软件启动。若出现报毒和添加信任事件，信则用。" ,
"7、脚本各功能使用前，请查看对应项目设置界面的帮助信息，前两项为关键设置项。" ,
"8、脚本更新随缘，警告维权，问题反馈，脚本更新，该系列其他脚本，请关注B站账号：绘星痕。" ,
"9、脚本设置功能保存：" ,
"（1）设置信息保存在同目录下“hxls_resource\\config0.json”和“config”文件夹中，可使用文本查看器打开查看，但勿轻易修改。" ,
"（2）点击保存后，界面的设置才进行保存。但脚本运行会依照界面上的设置。" ,
"10、脚本运行历史可在同目录下“hxls_resource\\logging.txt”文件中查看。" ,
"11、脚本资源可在同目录下“hxls_resource”文件夹中查看。" ,
"12、编写者为自学，边学边写，若有错漏可笑之处，愿幸蒙指教。脚本源码请私聊B站账号：绘星痕,欢迎交流学习。"],
"配置切换":["提示：" ,
"1、选择配置时会自动将所有设置选项切换。" ,
"2、点击保存后，界面的设置才进行保存，并更新到当前选框的配置中。" ,
"3、新建配置会新建一个默认配置，目前删除配置只能在文件夹里删除对应配置文件。" ,
"4、点击重命名后即可更改当前配置的名称，更改完成后请点击完成才能重命名成功。",
"5、启动设置页面以及配置切换页面为主配置，其他页面为次配置。切换配置时，主配置不变化，次配置切换。",
"6、点击启动后，脚本会按照当前界面（而非保存的设置）执行。"],
"启动游戏":[
"游戏启动路径设置帮助：" ,
"1、路径中尽量不要使用汉字。",
"2、请使用游戏本体的路径（而非启动器）。",
"3、路径格式请参照：",
"D:\\Program Files (x86)\\hxls\\环行旅舍.exe",
"4、可设置三个定时执行时间点。可自行输入定时执行的时间，勾选“每天”选框会更改为每天执行。并且在勾选“启用”选框后，对应定时才会发挥作用。",
"5、时间到点后会按照每项选定的配置文件已保存的设置执行，与当前界面的设置无关。",
"6、定时功能每20秒与系统时间校对并执行判断，任务在运行时，时间校对功能将暂停",
"7、点击启动后，脚本会按照当前界面（而非保存的设置）执行。"
],
"作战/重游":[
"提示：" ,
"1、该功能在使用时不会使用“能源回复装置”，但会使用当前全部能源。",
"2、重游选框会在游戏已有完成作战时领取作战奖励并尝试重复上次作战，启用该选框时会无效化材料选择选框，即使当前没有没有作战已完成。该功能用于连续刷取特殊材料（第一次刷取请手动开启）。" ,
"3、目前材料选择仅支持定格帧（养成材料）三种关卡：获取“格”，“风物志”，“节”。"],
"线下采购":[
"提示：" ,
"1、材料选择请勿重复，按照顺序选择最佳。" ,
"2、方案选择会在前四行优先寻找选定的项目，没有找到匹配的项目会默认选择第一行。" ],
"战术回顾":[
"提示：" ,
"1、目前仅支持选框内的项目，并为所有战术回顾选择。", 
"2、由于能力所限，目前部分选项选择成功率并不为100%。（例如28%可能误选到23%）",
"3、支持在“picture\\review”文件夹和“index.json”文件中自行添加项目,截图请使用1080p。"],
"集市领取":[
"提示：" ,
"1、该功能会自动领取集市中的：礼包商城-每日配给；援外商区-援外协议。" ],
"舍友访募":[
"提示：",
"1、目前版本该功能尚不完善，可能遇到未知错误，请谨慎使用。",
"2、该功能识别到必出SR、SSR时会自动跳过。",
"3、普通访募识别到，招募出SR、SSR时会自动截图保存在screenshot文件夹中，并命名截图为领取时的时间。",
"4、加速选框功能会一直使用高速显影剂和外显记录直到缺少高速显影剂或外显记录或格，但不会对启用功能前已开始招募的使用加速，使用该功能时请确保至少有一个普通招募空闲。"],
"今日工作":["提示：该功能会领取所有今日工作奖励。"],
"使用随机包":["提示：","1、目前版本该功能尚不完善，可能遇到未知错误，请谨慎使用。","2、该功能会使用所有物资里的随机礼包，但不会使用自选礼包和其他物品。"],
"完成后关闭游戏":["提示：该功能会在完成以上所有功能后自动关闭游戏，但不会关闭脚本窗口。"]
}