{
"使用须知":[
"使用须知：",
"1、所有脚本都不保证没有封号风险，怕别用，封认罚。" ,
"2、脚本从开发以来两个月，暂无封禁或警告案例。当发现相关案例，我会立刻在视屏评论区置顶通知。" ,
"3、本脚本使用python编写，不读写内存。使用实时截屏在关键节点进行读屏判断，使用模拟鼠标点击，移动，键盘按键进行操作，本质为连点器。" ,
"4、脚本运行期间任何键鼠操作都可能导致脚本运行失败，请点击界面上“停止”按钮或键盘组合键“ctrl+/”停止脚本。" ,
"5、本脚本为绿色免安装版，无联网功能。账号请自行设置长期默认登录，本脚本无登录功能，本人没有心情也没有能力写病毒和盗号功能。" ,
"6、脚本运行需要管理员权限，用于软件启动。若出现报毒和添加信任事件，信则用。" ,
"7、脚本各功能使用前，请查看对应项目设置界面的帮助信息，前两项为关键设置项。" ,
"8、脚本更新随缘，警告维权，问题反馈，脚本更新，该系列其他脚本，请关注B站账号：绘星痕。" ,
"9、脚本设置功能保存：" ,
"（1）设置信息保存在同目录下“genshin_resource\\config0.json”和“config”文件夹中，可使用文本查看器打开查看，但勿轻易修改。" ,
"（2）点击保存后，界面的设置才进行保存。但脚本运行会依照界面上的设置。" ,
"10、脚本运行历史可在同目录下“genshin_resource\\logging.txt”文件中查看。" ,
"11、脚本资源可在同目录下“genshin_resource”文件夹中查看。" ,
"12、编写者为自学，边学边写，若有错漏可笑之处，愿幸蒙指教。脚本源码请私聊B站账号：绘星痕,欢迎交流学习。"],
"配置切换设置帮助":["提示：" ,
"1、选择配置时会自动将所有设置选项切换。" ,
"2、点击保存后，界面的设置才进行保存，并更新到当前选框的配置中。" ,
"3、新建配置会新建一个默认配置，目前删除配置只能在文件夹里删除对应配置文件。" ,
"4、点击重命名后即可更改当前配置的名称，更改完成后请点击完成才能重命名成功。",
"5、启动设置页面以及配置切换页面为主配置，其他页面为次配置。切换配置时，主配置不变化，次配置切换。",
"6、点击启动后，脚本会按照当前界面（而非保存的设置）执行。"],
"启动设置帮助":[
"游戏启动路径设置帮助：" ,
"1、路径中尽量不要使用汉字。",
"2、请使用游戏本体的路径（而非启动器）。",
"3、路径格式请参照：",
"D:\\Program Files\\Genshin Impact\\Genshin Impact Game\\YuanShen.exe",
"4、可设置三个定时执行时间点。可自行输入定时执行的时间，勾选“每天”选框会更改为每天执行。并且在勾选“启用”选框后，对应定时才会发挥作用。",
"5、时间到点后会按照每项选定的配置文件已保存的设置执行，与当前界面的设置无关。",
"6、定时功能每20秒与系统时间校对并执行判断，任务在运行时，时间校对功能将暂停。",
"7、点击启动后，脚本会按照当前界面（而非保存的设置）执行。"
],
"派遣设置帮助":["请勿选择重复。"],
"参量质变仪设置帮助":[
"提示：可自行设置添加材料，设置方法如下。" ,
"1、在游戏1080p窗口或1080p全屏截取，保存格式为png，放置于同目录“genshin_resource\\picture”中的下列对应文件夹中：" ,
"根据材料种类从左到右依次为：" ,
"养成道具”develop_tools“或食物”food“或材料”material“，" ,
"文件名可自拟，应为字母与数字的组合。" ,
"2、截取图片应为标图方框内，不包括材料数量的材料图案。" ,
"3、图案不宜过小，会影响识别率。" ,
"4、将图片路径单条填入上方框内，程序会从上到下依次识别。"],
"晶蝶设置帮助":[
"提示：" ,
"1、使用本功能请确保对应地图通畅，如：锚点开启，附近任务已完成，有关解密已完成，等等。" ,
"2、晶蝶捕捉有随机性，有两个点位有晶蝶悬停不动，一个点位为触发晶蝶，可稳定捕捉，其他点位晶蝶捕捉率不为百分百。" ],
"配队设置帮助":[
"提示：" ,
"第一次使用请亲手配置队伍，为该程序保留左边/上边第一个队伍为跑图队伍。" ,
"队伍需求：" ,
"（1）1号位为任意成女角色(如丽莎，雷电将军），武器、天赋、队伍共鸣不应有加速buff；" ,
"（2）2号为草元素主角或纳西妲，用于捕捉晶蝶的机关触发；" ,
"（3）队伍中应有早柚，瑶瑶等角色，用于捕捉晶蝶。"],
"尘歌壶设置帮助":[
"提示：目前只适配璃月主楼。使用本功能请手动将默认壶内的主楼换为璃月主楼（与地图场景无关）。"],
"关闭游戏设置帮助":["提示：该功能会在完成以上所有功能后自动关闭游戏，但不会关闭脚本窗口。"]
}